Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཕྱིར་གྲོང་ཁྱེར་དུ་འགྲོ་མི་འདོད་པར་གྱུར་ཏོ། །
en: He no longer wished to return to the city,

source: དེ་དེར་ལོ་ལྔ་སྟོང་གི་བར་དུ་དགེ་སློང་རྣམས་ལ་རིམ་གྲོ་བྱེད་ཅིང་འདུག་སྟེ།
en: so he remained there and served the monks for five thousand years.

source: བྱམས་པའི་ཏིང་ངེ་འཛིན་ཀྱང་བསྐྱེད་ནས། དེས་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས།
en: He progressed in meditative stabilization on love, went for refuge, and maintained the fundamental precepts all his life.

source: དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may I be well proportioned, pleasing to the eye, and beautiful.

source: བདག་གིས་སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease a teacher just like this one.

source: དེའི་ཚེ་རྒྱལ་པོའི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཁྱེའུ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was the prince then is none other than this young man.

source: དེས་དེར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་རྣམས་ལ་བཀུར་སྟི་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: The act of serving the saṅgha of disciples of the totally and completely awakened Buddha Krakucchanda and saying that prayer at the time of his death ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེས་དེར་བྱམས་པ་བསྒོམས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པ་དེས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏོ། །
en: “The act of contemplating love ripened such that wherever he was born, he was well proportioned, pleasing to the eye, and beautiful.

source: དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all his life then, his faculties ripened, and now he has been liberated.”

source: མི་རྒོད་ཅེས་བྱ་བ་ནི།
en: The Bandits

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ནས། རྒྱལ་པོའི་ཁབ་ཀྱི་བར་མཚམས་ན། ཤིང་སཱ་ལའི་ནགས་ཁུང་ན། མི་རྒོད་ལྔ་བརྒྱ་ཙམ་ཞིག་ཁྲོ་ཞིང་གནས་ཏེ།
en: When the Blessed One was in Śrāvastī, some five hundred bandits menacingly dwelt in a certain thicket of sāl trees on the border of Śrāvastī and Rājagṛha.

source: དེ་དག་དེ་ན་འཁོད་པས་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: Their presence there meant that a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེར་འགྲོན་པོ་མང་པོ་དག་ཅིག་བཅོམ་ནས། ཚོང་པ་རྣམས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ཐད་དུ་དོང་སྟེ། རྒྱལ་པོ་ལ་གསོལ་ནས།
en: One day after many travelers had been robbed, the merchants approached King Prasenajit to inform him,

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བུ་འཕགས་སྐྱེས་པོ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྡན་པ་བསྒྲོགས་ཏེ།
en: and King Prasenajit’s son, Prince Videha , mustered the four divisions of his army.

source: དེར་བཏང་ནས་དེས་མི་རྒོད་ལྔ་བརྒྱ་པོ་དེ་དག་གསོན་པོར་བཟུང་སྟེ་འོང་ནས། རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཕུལ་ལོ། །
en: They went and captured the five hundred bandits alive and brought them before King Prasenajit.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་མི་རྒོད་ལྔ་བརྒྱ་གསོད་དུ་བཏང་སྟེ། གཤེད་མ་རྣམས་ཀྱིས་མི་རྒོད་ལྔ་བརྒྱ་པོ་དེ་དག་བསད་པའི་སར་ཁྲིད་པ་ན།
en: He handed the five hundred bandits over to his executioners to be killed, and they led them away to the execution grounds.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ་རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པར་ཉེ་བར་བཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ་སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། །ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ་ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ཕོངས་ཤིང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན།
en: Who is destitute, in a dreadful state, and being harmed?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མི་རྒོད་ལྔ་བརྒྱ་འདུལ་བའི་དུས་ལ་བབ་པར་དགོངས་ནས།
en: The Blessed One knew that the time had come to tame the five hundred bandits,

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་སོ། །
en: so he disappeared from the garden of Prince Jeta and traveled to the royal court,

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: where King Prasenajit saw the Blessed One from a distance.

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: He approached the Blessed One,

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and upon his arrival he touched his head to the Blessed One’s feet and asked him,

source: བཅོམ་ལྡན་འདས་ཅི་ལ་གཤེགས་ལགས།
en: “Blessed One, why have you come?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་རིགས་ཀྱི་བུ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་མ་བསད་པར་ཐོང་ཤིག །
en: “Great King,” the Blessed One replied, “do not slay these five hundred noble children. Release them instead.”

source: རྒྱལ་པོས་གསོལ་པ། གལ་ཏེ་རབ་ཏུ་བྱུང་ན་བཏང་བར་འཚལ་ལོ་ཞེས་གསོལ་ནས
en: “If they go forth,” replied the king, “I shall release them.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་མི་རྒོད་ལྔ་བརྒྱ་པོ་དེ་དག་ཕྱིར་ཟློག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ། །
en: King Prasenajit brought out the five hundred bandits and presented them to the Buddha.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཁྲིད་ནས་རབ་ཏུ་ཕྱུང་སྟེ།
en: The Blessed One led them to the garden of Prince Jeta and led them to go forth as novices,

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་མི་རྒོད་ལྔ་བརྒྱ་སྲོག་ཕངས་པ་སྩལ་ཏེ།
en: “Lord,” the monks requested the Blessed One, “tell us why you saved the precious lives of the five hundred bandits and

source: གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས།
en: established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་རིགས་ཀྱི་བུ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་སྲོག་ཕངས་པ་བྱིན་ཏེ།
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I saved the lives of all five hundred of these children of good lineage, and

source: ཅི་ལྟར་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: placed them in the four meditative states and the five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ཡུལ་བི་དེ་ཧ་ཞེས་བྱ་བ་ན། རྒྱལ་པོ་དབང་ཆེན་སྡེ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, it took place in times gone by, during King Mahendrasena’s reign in Videha.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་རི་དགས་བཤོར་དུ་སོང་བ་ལས། རྒྱལ་པོ་དེ་ལ་བློན་པོ་ལྔ་བརྒྱས་གླགས་བཙལ་ཏེ། དེ་དག་གིས་བསམས་པ།
en: One day the king arrayed the four divisions of his army, and as they set out to hunt deer, his five hundred ministers, who wished to harm to the king, thought,

source: ད་ནི་རྒྱལ་པོ་འདི་བདག་གི་ལག་ན་འདུག་གིས།
en: ‘Now the king is in our hands.

source: འདི་འདུག་པ་ཁོ་ནའི་ཚེ། བདག་ཅག་གིས་འདི་བསད་དོ་སྙམ་མོ། །
en: We should kill him while he’s still here.’

source: འཇིག་རྟེན་པ་དག་ནི་དགྲ་དང་ཟིན་གྱི་ནང་དུ་འདུག་སྟེ།
en: “Now, worldly people are surrounded by both enemies and friends.

source: དེར་གཞན་དག་གིས་རྒྱལ་པོ་ལ་སྦྲན་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དབང་ཆེན་སྡེས་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་གསོད་དུ་བཏང་སྟེ།
en: So it was that someone sent word to the king, and no sooner had King Mahendrasena heard about it than he handed over all five hundred ministers to be killed.

source: དེ་དག་གཤེད་མ་རྣམས་ཀྱིས་ཁྲིད་ནས།
en: The executioners led them away.

source: ནགས་ཁྲོད་ཅིག་ཏུ་ཞུགས་ཏེ་བསད་ཅེས་བྱས་པ་ལས།
en: They entered the forest, and as the king ordered, ‘Kill them now!’

source: ནགས་ཁྲོད་དེ་ན་དྲང་སྲོང་ཞིག་གནས་ཏེ། དྲང་སྲོང་དེས་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་རྒྱལ་པོ་དབང་ཆེན་སྡེ་ལ་གཏོང་དུ་བཅུག་ནས། དཀའ་ཐུབ་ཀྱི་གནས་སུ་ཁྲིད་དེ་རབ་ཏུ་བྱུང་ངོ་། །
en: a certain sage who was living in the forest convinced him to release all five hundred ministers instead. The sage then led them to a place devoted to austerities.

source: རབ་ཏུ་ཕྱུང་ནས་དེ་དག་གིས་ཀྱང་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After they went forth before him, they generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་བློན་པོ་ལྔ་བརྒྱ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་རིགས་ཀྱི་བུ་ལྔ་བརྒྱ་པོ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were the five hundred ministers are none other than these five hundred noble children.

source: དེའི་ཚེ་ཡང་དེ་དག་གསོད་དུ་བཏང་བ་ལས་ངས་སྲོག་ཕངས་པ་བྱིན་ཏེ།
en: At that time I delivered them from being killed, saved their precious lives, and

source: བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: placed them in the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་འདི་རྣམས་ངས་སྲོག་ཕངས་པ་བྱིན་ནས།
en: Now as well I have saved their precious lives and

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་འདི་རྣམས་རབ་ཏུ་བྱུང་ནས།
en: “They also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: འདི་རྣམས་ཀྱིས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན།
en: After practicing pure conduct all their lives then, their faculties ripened,

source: ཤ་ཟ་ཞེས་བྱ་བ་ནི།
en: The Piśācas

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་དང་། རྒྱལ་པོའི་ཁབ་ཀྱི་བར་མཚམས་ན་ཤ་ཟ་སྟོང་གནས་ཏེ།
en: When the Blessed One was in Rājagṛha, a thousand piśācas were living at the border between Śrāvastī and Rājagṛha.

source: དེ་དག་གིས་དེ་ཕྱོགས་སུ་འདྲུལ་བཅད་དེ། ཡུལ་མ་ག་དྷཱ་དང་ཡུལ་ཀོ་ས་ལའི་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: They cut off all passage and killed many in the countries of Magadha and Kośala.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་ཕོ་ཉས་བཟླུགས་ཏེ།
en: King Prasenajit dispatched an envoy to King Bimbisāra, asking him,

source: མཉན་དུ་ཡོད་པ་དང་རྒྱལ་པོའི་ཁབ་ཀྱི་བར་མཚམས་ན། ཤ་ཟ་སྟོང་གནས་ཏེ།
en: “Did you know that there are a thousand piśācas living at the border between Śrāvastī and Rājagṛha,

source: དེ་དག་དེ་ན་འཁོད་པས། ཡུལ་གཉིས་ལ་གནོད་པ་ཆེན་པོ་བྱེད་པ་ཁྱོད་ཀྱིས་ཤེས་སམ།
en: and that they are doing great harm to our two countries by staying there?

source: བཅོམ་ལྡན་འདས་ཀྱང་ཁྱོད་ཀྱི་ཁམས་ན་བཞུགས་ན། ཤ་ཟ་དེ་རྣམས་ཀྱི་ཕྱིར་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་བའི་རིགས་སོ་ཞེས་སྤྲིང་ངོ་། །
en: Since the Blessed One is residing in your kingdom, it would be appropriate for you to make a request of the Blessed One regarding these piśācas.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: No sooner did King Bimbisāra hear this than he went to see the Blessed One.

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon his arrival he touched his head to the Blessed One’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དེ།
en: Once King Bimbisāra had taken a seat at one side, the Blessed One instructed, encouraged, inspired, and delighted him with a discourse on the Dharma.

source: ཆོས་ཀྱི་གཏམ་རྣམ་གྲངས་དུ་མས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: Once he had instructed, encouraged, inspired, and delighted him with many discourses on the Dharma, the Blessed One then sat without speaking.

source: དེ་ནས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས། བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་གྱི་མཇུག་རྫོགས་པར་རིག་ནས། སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Knowing that the Blessed One had completed his discourse, King Bimbisāra rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and said to the Blessed One,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་མ་རུངས་པ་དག་དགའ་བོ་དང་ཉེ་དགའ་ལ་སོགས་པ་ཡང་བཏུལ།
en: “Lord, the Blessed One has tamed vicious nāgas like Nanda, Upananda , and others besides.

source: གནོད་སྦྱིན་མ་རུངས་པ་འབྲོག་གནས་ལ་སོགས་པ་ཡང་བཏུལ་ན།
en: You have tamed the vicious yakṣa lord Aṭavika, and others besides.

source: ཡུལ་མ་ག་དྷཱ་དང་། ཀོ་ས་ལ་གཉིས་ཀྱི་བར་མཚམས་ན། ཤ་ཟའི་ཚོགས་ཆེན་པོ་གནས་ཏེ།
en: Now at the border between the countries of Magadha and Kośala there lives a great horde of piśācas,

source: དེ་དག་དེ་ན་འཁོད་པས་སྐྱེ་བོ་མང་པོ་ལ་གནོད་པ་བགྱིད་ན།
en: and by staying there they are doing harm to many.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤ་ཟའི་ཚོགས་དེ་དག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་འདུལ་བར་གསོལ།
en: Blessed One, out of compassion for the horde of piśācas, please tame them.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to King Bimbisāra by his silence.

source: དེ་ནས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: Understanding that by his silence the Blessed One had given his assent, King Bimbisāra touched his head to the Blessed One’s feet and took leave of him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཤ་ཟ་དེ་རྣམས་འདུལ་བའི་དུས་ལ་བབ་པར་གཟིགས་ནས། རྒྱལ་པོའི་ཁབ་ནས་མི་སྣང་བར་གྱུར་ཏེ། སཱ་ལའི་ནགས་ཁུང་ཤ་ཟ་རྣམས་ཀྱི་འདབ་ཏུ་གཤེགས་སོ། །
en: The Blessed One saw that the time had come to tame the piśācas so he disappeared from Rājagṛha and traveled to the sāl forest, close to where the piśācas were.

source: དེ་ནས་ཤ་ཟ་དེ་རྣམས་ཀྱིས་ཐག་རིང་པོ་ཞིག་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The piśācas saw the Blessed Buddha from a distance,

source: མཐོང་ནས་ཀྱང་གཟུགས་མི་སྡུག་པར་བསྒྱུར་ཏེ། ཤུགས་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཐོག་ཏུ་བརྒྱུགས་སོ། །
en: and upon seeing him they took on a hideous appearance and charged at the Blessed One with great force.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་དེ།
en: The Blessed One had a thought about the world:

source: ཀྱེ་མ་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་གནོད་སྦྱིན་ཆེ་བར་གྲགས་སོ་ཅོག་དང་ལྷན་ཅིག་ཏུ་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་ན་ལེགས་སོ་སྙམ་དུ་དགོངས་ནས།
en: “It would be good for the great king Vaiśravaṇa to come see me with the yakṣa Maheśākhya!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ། གནོད་སྦྱིན་ཆེ་བར་གྲགས་སོ་ཅོག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: No sooner had the Blessed One had this thought than the great king Vaiśravaṇa and the yakṣa Maheśākhya came to see the Blessed One.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Upon their arrival they touched their heads to the Blessed One’s feet and took a seat at one side.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། གནོད་སྦྱིན་ཆེ་བར་གྲགས་སོ་ཅོག་གཞན་དག་གིས་ཤ་ཟའི་ཚོགས་རྣམས་གཙེས་ནས་དེ་དག་འཇིགས་ཤིང་སྐྲག་སྟེ། ཕན་ཚུན་དུ་འབྱེར་བར་བརྩམས་པ་ལས།
en: The horde of piśācas, terrified that the great king Vaiśravaṇa and the yakṣa Maheśākhya would do them harm, began to run all about.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་འདུལ་བའི་ཕྱིར། ཁོ་ར་ཁོར་ཡུག་ནས་མེ་ལྕེ་ཆེན་པོ་སྤྲུལ་ནས།
en: The Blessed One emanated flames all about them in order to tame them.

source: དེ་དག་གིས་བདག་ཅག་ཉིད་མེ་ལྕེ་ཆེན་པོས་འཁོར་བ་མཐོང་སྟེ། འབྲོས་ཀྱང་མ་ནུས་ནས།
en: The piśācas saw there were great flames all about them and that they could not run away,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་དྲུང་འབའ་ཞིག་ཞི་བར་མཐོང་སྟེ།
en: and that it was only peaceful at the feet of the Blessed One.

source: སྐྱབས་འཚོལ་ཞིང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ལ་བསྐོར་ནས་འཁོད་དོ། །
en: In search of refuge they went to the Blessed One and upon their arrival sat in a circle around him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཤ་ཟ་དེ་རྣམས་ལ་བཀའ་སྩལ་པ། ཁྱོད་སྔོན་གྱི་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱིས་ཤ་ཟའི་སྐྱེ་གནས་དམའ་བར་སྐྱེས་ལ་
en: “My friends,” the Blessed One said to the piśācas, “you have taken birth in the lower realms, as piśācas, because of your past sins and nonvirtuous actions.

source: ད་ལྟར་ཡང་ཁྱེད་སྐྱེ་བོ་མང་པོ་ལ་གནོད་པར་བྱེད་ན
en: Even now you are doing harm to many.

source: འདི་ནས་ཤི་འཕོས་ན་ཁྱེད་ཀྱི་འགྲོ་བ་ནི་ཅིར་འགྱུར། སྐྱེ་གནས་ནི་ཅི་ཡིན།
en: When you die and transmigrate, what will be the state of your rebirth?

source: འགྲོ་བའི་ས་ནི་གང་ཡིན།
en: Where will you go?”

source: དེ་དག་གིས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་བཀའ་ཅི་སྩལ།
en: “What advice can you grant us?” they asked.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ཕྱིན་ཆད་སྡིག་པ་ལས་བཟློག་ལ། སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ཟུང་ཤིག །
en: “From this day forth,” the Blessed One instructed them, “give up sinful actions, go for refuge, and maintain the fundamental precepts.”

source: ཤ་ཟ་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་བཀའ་ཅི་སྐད་སྩལ་བ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་གསོལ་ནས
en: “As you wish, Blessed One,” the piśācas replied.

source: ཤ་ཟ་དེ་རྣམས་ཀྱིས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་ཏེ། དེ་ཕྱིན་ཅད་སྡིག་པའི་ལས་སྤངས་སོ། །
en: Then the piśācas went for refuge, took the fundamental precepts, and gave up sinful actions.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དེ་དག་དང་འཚམ་པའི་ཆོས་བསྟན་ནས།
en: The Blessed One taught them the Dharma that was appropriate for them,

source: ཤིང་སཱ་ལའི་ནགས་ཁུང་ནས་མི་སྣང་བར་གྱུར་ཏེ། འོད་མའི་ཚལ་དུ་གཤེགས་སོ། །
en: then disappeared from the sāl forest and traveled to Bamboo Grove.

source: ཤ་ཟ་དེ་རྣམས་ཀྱང་བླ་ན་མེད་པའི་ལམ་ལ་གནས་པར་གྱུར་ནས།
en: The piśācas remained on the unexcelled path,

source: ཕན་ཚུན་འདྲུལ་བ་རྣམས་ལ་ཆུ་སྦྱིན་པར་བྱེད་དོ། །
en: and they gave water to those who were traveling by,

source: ཁ་ཟས་ཀྱང་སྦྱིན་པར་བྱེད་དོ། །
en: and gave them food as well.

source: ལམ་སྟོར་བ་རྣམས་ལ་ཡང་ལམ་སྟོན་པར་བྱེད་དོ། །
en: To those who had lost their way, they showed the way.

source: དེ་ནས་ཡུལ་ཀཱ་ཤི་དང་། ཡུལ་ཀོ་ས་ལའི་མི་རྣམས་ངོ་མཚར་དུ་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟར་འདུལ་བར་དཀའ་བ་འདི་དག་བཏུལ་ལོ། །ཞེས་འཛེར་ཏོ། །
en: The people of Kāśi and Kośala were filled with wonder and exclaimed, “The Blessed One tames those who are difficult to tame!”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཤ་ཟ་འདི་དག་ཀྱང་བཏུལ་ཏེ།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why the Blessed One has tamed even these demons,

source: སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ཀྱང་འཛིན་དུ་སྩལ་ལ། སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཡང་སྨན་བཏགས་པ་ལ་གཟིགས།
en: leading them to go for refuge and take the fundamental precepts so they would be of benefit to many!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་འདི་རྣམས་སྡིག་པའི་ལས་ལས་བཟློག་སྟེ། ཅི་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I turned them away from sinful actions and set them on the path of the ten virtuous actions. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ས་ཕྱོགས་འདི་ཉིད་ན་ཤ་ཟའི་ཚོགས་ཆེན་པོ་གནས་གནས་ཏེ།
en: “Monks, in times gone by a great horde of piśācas lived in this very place for a long time.

source: དེ་དག་འདི་ན་གནས་པས་ཡུལ་ཀཱ་ཤི་དང་། ཀོ་ས་ལའི་མི་རྣམས་མ་རུངས་པར་བྱེད་པ་ལས།
en: By living there, they brought ruin upon the people of the countries of Kāśi and Kośala.

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ན་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན་དྲང་སྲོང་ཞིག་གནས་ཏེ
en: “There was a certain sage living in a place devoted to austerities near the city of Rājagṛha,

source: སྐྱེ་བོ་མང་པོ་དེ་དག་གིས་ཤ་ཟ་དེ་དག་གདུལ་བའི་ཕྱིར་དྲང་སྲོང་དེ་ལ་གསོལ་བ་བཏབ་ནས། དྲང་སྲོང་དེས་ཤ་ཟ་དེ་དག་བཏུལ་ཏེ།
en: and after many people had asked the sage to tame the piśācas, the sage tamed the piśācas and

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: set them on the path of the ten virtuous actions.

source: དེའི་ཚེ་ཤ་ཟར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ཤ་ཟ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were that horde of piśācas are none other than these piśācas.

source: དེའི་ཚེ་ཡང་ངས་འདི་དག་བཏུལ་ཏེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: At that time I set them on the path of the ten virtuous actions.

source: ད་ལྟར་ཡང་ངས་འདི་དག་སྡིག་པའི་ལས་ལས་བཟློག་སྟེ།
en: Now as well I have turned them away from sinful actions and

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ།། །།
en: set them on the path of the ten virtuous actions.”

source: དབང་པོའི་མགོ་ཞེས་བྱ་བ་ནི།
en: The Story of Head of Indra

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡུལ་ཡངས་པ་ཅན་ན། འཕོང་གི་སློབ་དཔོན་དབང་པོའི་མགོ་ཞེས་བྱ་བ་འཕོང་གི་རིག་པ་ཐམས་ཅད་ཀྱི་མཐར་ཕྱིན་པ་ཞིག་གནས་པ་དེས།
en: When the Blessed One was in Rājagṛha, in Vaiśālī there lived a certain archery master named Head of Indra who knew everything there was to know about archery.

source: ལིཙྪ་བཱི་ལྔ་བརྒྱ་ལ་འཕོང་གི་རིག་པ་བསླབས་ནས། དེ་དག་ཀྱང་དེ་ལ་མཐར་ཕྱིན་པར་གྱུར་ཏེ། སྟོབས་པོ་ཆེར་ཡང་གྱུར་ཏོ། །
en: He trained five hundred Licchavis in archery, and they mastered it and became very powerful.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོའི་ཁབ་ན་གནས་པ་རྣམས་དང་། ཡངས་པ་ཅན་ན་གནས་པ་རྣམས་འགྲས་པར་གྱུར་ཏེ།
en: One day a disagreement arose between the people of Rājagṛha and Vaiśālī,

source: རྒྱལ་པོའི་ཁབ་ན་གནས་པ་རྣམས་ཀྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས།
en: and the people of Rājagṛha arrayed the four divisions of their army

source: གཡུལ་འགྱེད་པའི་ཕྱིར་ཡངས་པ་ཅན་ན་གནས་པ་རྣམས་ཀྱི་སྟེང་དུ་དྲངས་སོ། །
en: and advanced on Vaiśālī to wage war.

source: དེ་ནས་འཕོང་གི་སློབ་དཔོན་དབང་པོའི་མགོས། རྒྱལ་པོའི་ཁབ་ན་གནས་པ་རྣམས་ཀྱིས་གཡུལ་འགྱེད་པའི་ཕྱིར། བདག་ཅག་གི་སྟེང་དུ་དྲངས་སོ་ཞེས་ཐོས་སོ། །
en: Master archer Head of Indra heard that Rājagṛha was advancing on them to wage war,

source: ཐོས་ནས་ཀྱང་གཡུལ་འགྱེད་པའི་ཕྱིར་འཁོར་ལྔ་བརྒྱ་དང་ཆས་ཏེ། རྒྱལ་པོའི་ཁབ་ཀྱི་དམག་གི་སྟེང་དུ་དྲངས་སོ། །
en: and when he heard this he set out with a retinue of five hundred and advanced on the Rājagṛha army to wage war.

source: དེ་དག་གིས་དྲངས་ནས་སྐྱེ་བོ་མང་པོ་ཁ་བཏག་སྟེ།
en: As they advanced they massacred many,

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དམག་མི་རྣམས་འབྲོས་སོ། །
en: and the Rājagṛha soldiers fled.

source: དེ་བཞིན་དུ་ལན་གཉིས་ལན་གསུམ་ནས་ལན་ལྔའི་བར་དུ་རྒྱལ་པོའི་ཁབ་ཀྱི་སྐྱེ་བོ་མང་པོ་རྣམས་ཁ་བཏག་གོ། །
en: Many people of Rājagṛha were slaughtered as they advanced again not twice or thrice but five times.

source: དེ་ནས་འཕོང་གི་སློབ་དཔོན་དབང་པོའི་མགོས་མི་ལྔ་སྟོང་མདའ་འཕངས་ཏེ་བསད་དོ་ཞེས་ཐོག་ཐག་ཏུ་གྲགས་སོ། །
en: Soon word spread that master archer Head of Indra had shot five thousand men with arrows and killed them all.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོའི་ཁབ་ན་གནས་པའི་མི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏེ།
en: So it was that one day the people of Rājagṛha implored the Blessed One,

source: བཙུན་པ་དབང་པོའི་མགོ་དེ་ནི་བདག་ཅག་གི་དགྲ་མ་ལགས་པའི་དགྲ། འགྲན་ཟླ་མ་ལགས་པའི་འགྲན་ཟླ་ལགས་ཏེ།
en: “Lord, Head of Indra is an adversary to those without adversaries, a rival to those without rivals.

source: བཙུན་པ་དེས་ནི་མི་ལྔ་སྟོང་ཙམ་ཁ་བཏག་ལགས་ན།
en: Lord, he has killed some five thousand men.
